#include "headers.h"

void Menu()
{
	std::cout << "\tГЛАВНОЕ МЕНЮ\n";
	std::cout << "1) Чтение БД из файла.\n";
	std::cout << "2) Запись данных в БД в файл.\n";
	std::cout << "3) Сортировка БД.\n";
	std::cout << "4) Редактирование БД.\n";
	std::cout << "5) Вывод БД на экран.\n";
	std::cout << "6) Выход.\n\n";
	std::cout << "Введите номер желаемой операции: ";
}

void edit()
{
	std::cout << "\tМЕНЮ РЕДАКТИРОВАНИЯ\n";
	std::cout << "1) Редактировать определенную строку\n";
	std::cout << "2) Добавить новую строку в БД\n";
	std::cout << "3) Удалить строку\n";
	std::cout << "4) Выход.\n\n";
	std::cout << "Введите номер желаемой операции: ";
}